{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Care Management",
  "sub_category": "Care Management",
  "process_name": "Manage Population Health Outreach",
  "process_code": "CM",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Manage Population Health Outreach Capability Question Is the process primarily manual or automatic? use standards in the process?",
        "levels": {
          "level_1": "activity to accomplish tasks. SMA focuses on meeting compliance thresholds for state and federal regulations using",
          "level_2": "automatic processes to accomplish process tasks. SMA complies information with a mix of manually and automatic reports. SMA applies a mix of HIPAA and state- specific standards. Manage Population Health Outreach",
          "level_3": "extent possible within the intrastate. SMA automates the identification of the target population to enhance case management services. SMA automates the matching of individuals with programs and materials to meet their needs. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for",
          "level_4": "regionally to the extent possible across the interstate. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for clinical",
          "level_5": "to the extent possible across the nation. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for national"
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question How does the State Medicaid Agency collaborate with other agencies or entities in performing the process?",
        "levels": {
          "level_1": "",
          "level_2": "transactions. SMA accesses a variety of information systems for research and reporting to identify members receiving medical care from multiple agencies simultaneously.",
          "level_3": "to adopt national standards, and to develop and share reusable business services.",
          "level_4": "and to develop and share reusable processes including clinical information shared via a regional Health Information Exchange (HIE).",
          "level_5": "interoperability improvements that maximize automation of routine operations shared across the Nationwide Health Information Network (NwHIN)."
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "How timely is this end-to-end process?",
        "levels": {
          "level_1": "mandated requirements for timeliness (i.e., the",
          "level_2": "of automation. Timeliness exceeds Manage Population Health Outreach",
          "level_3": "collaboration, use of information sharing, standards, and",
          "level_4": "time. Processes that use clinical information result in",
          "level_5": "Processes improve further through connectivity with"
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accurate is the information in the process?",
        "levels": {
          "level_1": "collection is manually intensive and susceptible to inconsistent or incorrect information. Stakeholders are unable to rely on information for decision-making.",
          "level_2": "accuracy of information but the decision-making process may be erroneous or misleading. Accuracy is higher than at Level 1. Manage Population Health Outreach",
          "level_3": "increases the reliability of SMA’s internal information. External sources of information use MITA Framework for information exchange. Decision- making is automatic using standardized business rules definitions. Accuracy is 90% or higher.",
          "level_4": "increases the reliability of the regional SMA’s internal and external sources of information. SMA adopts MITA Framework for information exchange by regional agencies. Decision-making is automatic using regional standardized business rules",
          "level_5": "national information exchange. Decision- making is automatic using national standardized business rules definitions. Accuracy is 90% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accessible is the information in the process?",
        "levels": {
          "level_1": "disparate systems including paper storage and obtains information manually.",
          "level_2": "disparate systems, but automation and HIPAA standards increase accessibility over Level 1.",
          "level_3": "and exchanges with intrastate agencies and entities based on MITA Framework and industry standards. Accessibility is, on average, no more than three (3) seconds.",
          "level_4": "from regional agencies and entities. Accessibility is, on average, no more than three (3) seconds.",
          "level_5": "and exchanges with national agencies and entities. Accessibility is, on average, no more than three (3) seconds."
        }
      },
      {
        "category": "Business Capability Quality: Cost Effectiveness",
        "question": "What is the cost to perform the process compared to the benefits of the results?",
        "levels": {
          "level_1": "The process operates within state budget constraints. The benefits vary depending upon the types of studies",
          "level_2": "automation increases efficiency that allows additional benefits by focusing on increases reporting, more effective outreach, Manage Population Health Outreach",
          "level_3": "standards. SMA is able to measure the usefulness of the types of studies undertaken, the population studied,",
          "level_4": "standards for regional information exchange improving cost effectiveness ratio over Level 3.",
          "level_5": "standards for national (and international) information exchange. SMA increases cost effectiveness ratio"
        }
      },
      {
        "category": "Business Capability Quality: Effort to Perform; Efficiency",
        "question": "Capability Question How efficient is the process?",
        "levels": {
          "level_1": "Process is labor intensive. There is wasted effort or expense to accomplish tasks. Process meets minimum state process guidelines and SMA performance standards. Efficiency is low.",
          "level_2": "Automation and state standards increase productivity. Efficiency is higher than Level 1. Manage Population Health Outreach",
          "level_3": "SMA adopts MITA Framework, industry standards and information exchange with intrastate agencies and entities improving efficiency to 95% or higher.",
          "level_4": "SMA adopts MITA Framework, industry standards and information exchange with regional agencies and entities improving efficiency to 98% or higher.",
          "level_5": "SMA adopts MITA Framework, industry standards and information exchange with national agencies and entities improving efficiency to 98% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accurate are the results of the process?",
        "levels": {
          "level_1": "opportunity for human error. Accuracy is low.",
          "level_2": "business rules definitions reduce error and improve accuracy above Level 1.",
          "level_3": "standards and information exchange with intrastate agencies and entities improving accuracy to 99% or higher.",
          "level_4": "standards and information exchange with regional agencies and entities improving accuracy to 99% or higher.",
          "level_5": "standards and information exchange with national agencies and entities improving accuracy to 99% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Utility or Value to Stakeholders",
        "question": "Does the business process satisfy stakeholders?",
        "levels": {
          "level_1": "information negatively affecting stakeholder satisfaction with the process.",
          "level_2": "provides clear and useful information. Stakeholder satisfaction is greater than Level 1.",
          "level_3": "standards and information exchange with intrastate agencies and entities improving stakeholder satisfaction to 90% or higher. SMA uses survey or questionnaire for information collection.",
          "level_4": "standards and information exchange with regional agencies and entities improving stakeholder satisfaction to 95% or higher.",
          "level_5": "standards and information exchange with national agencies and entities improving stakeholder satisfaction to 98% or higher."
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Manage Registry Capability Question Is the process primarily manual or automatic? use standards in the process? process?",
        "levels": {
          "level_1": "paper-based activity to accomplish tasks. SMA focuses on meeting compliance thresholds for state and federal regulations using state-specific standards. Very little collaboration occurs with other agencies to standardize information exchange or business tasks.",
          "level_2": "automatic processes to accomplish tasks. SMA applies a mix of HIPAA and state- specific standards. SMA collaborates with other agencies and entities to adopt HIPAA standards and Electronic Data Interchange (EDI) transactions.",
          "level_3": "extent possible within the intrastate. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for intrastate exchange of registry information. SMA collaborates with other intrastate registry agencies and entities to adopt national standards, and to develop and share reusable",
          "level_4": "the extent possible across the interstate. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for clinical and interstate information exchange of regional registry information. SMA collaborates with other regional registry agencies and entities to adopt national standards, and to develop and share reusable",
          "level_5": "to the extent possible across the nation. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for national exchange of registry information. SMA collaborates with national agencies and entities for national (and international) interoperability improvements that"
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Care Management/Care Management BCM.pdf",
    "source_page_range": "15-21",
    "extracted_date": "2026-01-12"
  }
}