{
  "document_type": "BPT",
  "version": "3.0",
  "date": "February 2012",
  "business_area": "Plan Management",
  "process_name": "Maintain Program Policy",
  "process_code": "PL",
  "sub_category": "Plan Administration",
  "page_count": 2,
  "process_details": {
    "description": "The Maintain Program Policy Business Process responds to requests or needs for change in the enterprise's programs, benefits, or business rules, based on factors such as federal or state regulations, governing board or commission directives, Quality Improvement Organization's findings, federal or state audits, enterprise decisions, or consumer pressure.",
    "trigger_events": [
      "Periodic timetable (e.g., annual) is due for review of program policy.",
      "Periodic timetable (e.g., annual) is due to implement new program policy or modification.",
      "Ad hoc request for program policy updates."
    ],
    "results": [
      "The State Medicaid Agency (SMA) defines new or modified statement of program policy.",
      "Tracking information as needed for measuring performance and business activity monitoring."
    ],
    "process_steps": [
      "START: Receive request to add, delete, or change policy.",
      "Request information to analyze policy.",
      "Assess impact of policy on budget, stakeholders, and other benefits.",
      "Formulate and publish policy.",
      "Hold public hearings.",
      "Revise policy.",
      "Seek all federal and state administrative and regulatory approvals.",
      "If applicable, assess impact of requested revisions.",
      "Determine effective date and date span for policy in coordination with other enterprise considerations.",
      "If applicable, develop training plan for new policy.",
      "Develop implementation plan for policy.",
      "END: Disseminate policy."
    ],
    "shared_data": [
      "Plan data store including Medicaid State Plan, health plan, health benefits, performance measures, and benchmarks information",
      "Business Activity data store including performance information (e.g., Consumer Assessment of Healthcare Providers and Systems (CAPHS) and Healthcare Effectiveness Data and Information Set (HEDIS) measures)"
    ],
    "predecessor_processes": [
      "Develop Agency Goals and Objectives",
      "Manage Performance Measures",
      "Maintain State Plan"
    ],
    "successor_processes": [
      "Manage Health Plan Information",
      "Manage Health Benefit Information",
      "Maintain State Plan",
      "Manage Performance Measures",
      "Establish Business Relationship"
    ],
    "constraints": "Economic conditions shift, making less revenue available to fund the approved and planned budget. The SMA will comply with federal and state regulations.",
    "failures": [
      "Cost/benefit analysis does not support proposed policy.",
      "Inability to obtain necessary approvals."
    ],
    "performance_measures": [
      "Time to complete the process = within __ days, ___ weeks",
      "Achievement of goals and objectives linked to policy implementation"
    ]
  },
  "metadata": {
    "source_file": "BPT Vault v3.0/Plan Management 3.0/PL_Maintain_Program_Policy_BPT_v3.0.pdf",
    "extracted_date": "2025-12-05"
  }
}