{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Financial Management",
  "sub_category": "Financial Management",
  "process_name": "Manage Accounts Payable Disbursement",
  "process_code": "FM",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Manage Accounts Payable Disbursement What format does SMA use for payments? automatic? use standards in the process? process?",
        "levels": {
          "level_1": "automatic check write process to produce a paper check. SMA mails to the provider. State does not use Electronic Funds Transfers (EFT). The process consists primarily of manual paper-based activity to accomplish tasks. SMA focuses on meeting compliance thresholds for state and federal regulations using state-specific standards. Very little collaboration occurs with other agencies to standardize information exchange or business tasks.",
          "level_2": "standards for EFT and conforms to HIPAA requirements. SMA sends some paper checks to submitters. SMA encourages electronic billers to adopt EFT payment. SMA uses a mix of manual and automatic processes to accomplish tasks. SMA applies a mix of HIPAA and state- specific standards. Manage Accounts Payable Disbursement SMA collaborates with other agencies and entities to adopt HIPAA standards and Electronic Data Interchange (EDI) transactions.",
          "level_3": "standards, for EFT transactions. All submitters receive EFT payment. SMA automates process to the full extent possible within the intrastate. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for intrastate exchange of information. SMA collaborates with other intrastate agencies and entities to adopt national standards, and to develop and share reusable business services.",
          "level_4": "payments to the extent possible across the interstate. SMA automates process to the full extent possible across the interstate. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for clinical and interstate information exchange. SMA collaborates with other interstate agencies and entities to adopt national standards, and to develop and share reusable processes including clinical information.",
          "level_5": "payments to the extent possible across the nation. SMA automates process to the full extent possible across the nation. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for national exchange of information. SMA collaborates with agencies and entities for national (and international) interoperability improvements that maximize automation of routine operations."
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "How timely is the end-to-end process?",
        "levels": {
          "level_1": "mandated requirements for timeliness (i.e., the process achieves results within the time specified by law or regulation).The process may require weeks to complete a cycle.",
          "level_2": "use of automation. Timeliness exceeds legal requirements.The process requires no more than a week to complete a cycle. Manage Accounts Payable Disbursement",
          "level_3": "collaboration, use of information sharing, standards, and regional information exchange hubs. Timeliness exceeds Level 2.",
          "level_4": "available in near real time. Processes that use clinical information result in immediate action, response, and results. SMA has interstate interoperability, which further improves timeliness over Level 3.",
          "level_5": "available in real time. Processes improve further through connectivity with other States and with federal agencies. Most processes execute at the point of service. Results are almost immediate."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "How accurate is the information in the process? the information in the process?",
        "levels": {
          "level_1": "collection is manually intensive and susceptible to inconsistent or incorrect information. Stakeholders are unable to rely on information for decision-making. SMA stores information in disparate systems including paper storage and obtains information manually.",
          "level_2": "accuracy of information but the decision-making process may be erroneous or misleading. Accuracy is higher than at Level 1. SMA stores Manage Accounts Payable Disbursement information in disparate systems, but automation and HIPAA standards increase accessibility over Level 1.",
          "level_3": "increases the reliability of SMA’s internal information. External sources of information use MITA Framework and industry standards for information exchange. Decision-making is automatic using standardized business rules definitions. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with intrastate agencies and entities based on MITA Framework and industry standards. Accessibility is greater than Level 2.",
          "level_4": "increases the reliability of SMA’s internal and external sources of information. SMA adopts MITA Framework and industry standards for information exchange with interstate agencies. Decision-making is automatic using regional standardized business rules definitions. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with interstate agencies and entities. Accessibility is greater than Level 3.",
          "level_5": "industry standards for information exchange with national agencies. Decision-making is automatic using national standardized business rules definitions. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with national agencies and entities. Accessibility is greater than Level 4."
        }
      },
      {
        "category": "Business Capability Quality: Cost Effectiveness",
        "question": "What is the cost of the process compared to the benefits of its results?",
        "levels": {
          "level_1": "",
          "level_2": "ratio over Level 1.",
          "level_3": "improving cost effectiveness ratio over Level 2.",
          "level_4": "standards for interstate information exchange. SMA increases cost effectiveness ratio over Level 3.",
          "level_5": "standards for national (and international) information exchange. SMA increases cost effectiveness ratio over level 4."
        }
      },
      {
        "category": "Business Capability Quality: Effort to Perform; Efficiency",
        "question": "How efficient is the process?",
        "levels": {
          "level_1": "intensive. There is wasted effort or expense to accomplish tasks. Process meets minimum state process guidelines and SMA performance standards. Efficiency is low.",
          "level_2": "productivity. Efficiency is higher than Level 1.",
          "level_3": "Framework, industry standards and information exchange with intrastate agencies and entities improving efficiency to 95% or higher.",
          "level_4": "Framework, industry standards and information exchange with interstate agencies and entities improving efficiency to 98% or higher.",
          "level_5": "Framework, industry standards and information exchange with national agencies and entities improving efficiency to 98% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "How accurate are the results of the process?",
        "levels": {
          "level_1": "opportunity for human error. Accuracy is low.",
          "level_2": "standardized business rules definitions reduce error and improve accuracy above Level 1.",
          "level_3": "standards and information exchange with intrastate agencies and entities improving accuracy to 98% or higher.",
          "level_4": "Framework, industry standards and information exchange with interstate agencies and entities improving accuracy to 98% or higher.",
          "level_5": "Framework, industry standards and information exchange with national agencies and entities improving accuracy to 98% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Utility or Value to Stakeholders",
        "question": "Does the business process satisfy stakeholders?",
        "levels": {
          "level_1": "information negatively affecting stakeholder satisfaction with the process.",
          "level_2": "standardization provides clear and useful information. Stakeholder satisfaction is greater than Level 1.",
          "level_3": "Framework, industry standards and information exchange with intrastate agencies and entities improving stakeholder satisfaction to 90% or higher. SMA uses survey or questionnaire for information collection.",
          "level_4": "Framework, industry standards and information exchange with interstate agencies and entities improving stakeholder satisfaction to 95% or higher.",
          "level_5": "Framework, industry standards and information exchange with national agencies and entities improving stakeholder satisfaction to 98% or higher."
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Financial Management/Financial Management BCM.pdf",
    "source_page_range": "81-86",
    "extracted_date": "2026-01-12"
  }
}