{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Financial Management",
  "sub_category": "Accounts Receivable Management",
  "process_name": "Manage Estate Recovery",
  "process_code": "FM",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Is the process primarily manual or automatic?",
        "levels": {
          "level_1": "The process consists primarily of manual paper-based activity to accomplish tasks.",
          "level_2": "SMA uses a mix of manual and automatic processes to accomplish tasks.",
          "level_3": "SMA automates process to the full extent possible within the intrastate.",
          "level_4": "SMA automates process to the full extent possible across the interstate.",
          "level_5": "SMA automates process to the full extent possible across the nation."
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "What is the media of communication with stakeholders involved in the recovery? How integrated is the process?",
        "levels": {
          "level_1": "SMA communicates with stakeholders and members’ personal representatives via telephone, in person, facsimile, e-mail and mail. SMA has little coordination with other entities that are information sources. Data is not standardized and is often paper based.",
          "level_2": "Communication to stakeholders and members personal representatives is a mix of telephone, facsimile, and mail, plus the use of e-mail and electronic interchange for exchange of larger or standardized sets of information. Agencies are standardizing information to increase coordination Manage Estate Recovery and consistency. SMA encourages other stakeholders, including families, attorneys, funeral homes, and others, to use standard information elements. This improves the ability to complete recovery and allows application-to- application updates (e.g., automatic updates of the Member data store and Payment data store).",
          "level_3": "SMA communicates with stakeholders via primarily electronic media; paper communications are the exception. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for intrastate exchange of information.",
          "level_4": "SMA adopts MITA Framework, industry standards, and national standards for communications across the interstate. SMA fully integrates the process to the extent possible across the interstate.",
          "level_5": "SMA adopts MITA Framework, industry standards, and national standards for communication across the nation. SMA fully integrates the process to the extent possible across the nation."
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Does the State Medicaid Agency use standards in the process?",
        "levels": {
          "level_1": "SMA focuses on meeting compliance thresholds for state and federal regulations using state-specific standards.",
          "level_2": "SMA applies a mix of HIPAA and state- specific standards. Manage Estate Recovery",
          "level_3": "SMA adopts MITA Framework, industry standards, and other nationally recognized standards for intrastate exchange of information.",
          "level_4": "SMA adopts MITA Framework, industry standards, and other nationally recognized standards for clinical and interstate information exchange.",
          "level_5": "SMA adopts MITA Framework, industry standards, and other nationally recognized standards for national exchange of information."
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "How does the State Medicaid Agency collaborate with other agencies or entities in performing the process?",
        "levels": {
          "level_1": "Very little collaboration occurs with other agencies to standardize information exchange or business tasks.",
          "level_2": "SMA collaborates with other agencies and entities to adopt HIPAA standards and Electronic Data Interchange (EDI) transactions.",
          "level_3": "SMA collaborates with other intrastate agencies and entities to adopt national standards, and to develop and share reusable business services.",
          "level_4": "SMA collaborates with other interstate agencies and entities to adopt national standards, and to develop and share reusable processes including clinical information.",
          "level_5": "SMA collaborates with agencies and entities for national (and international) interoperability improvements that maximize automation of routine operations."
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "How timely is the end-to-end process? Note: Due to the",
        "levels": {
          "level_1": "Process meets threshold or mandated requirements for timeliness (i.e., the process achieves results within the time specified by law or regulation).",
          "level_2": "Process timeliness improves through use of automation. Timeliness exceeds legal requirements. Manage Estate Recovery",
          "level_3": "Timeliness improves via state and federal collaboration, use of information sharing, standards, and regional information exchange hubs. Timeliness exceeds Level 2.",
          "level_4": "Information is available in near real time. Processes that use clinical information result in immediate action, response, and results. SMA has interstate interoperability, which further improves timeliness over Level 3.",
          "level_5": "Information is available in real time. Processes improve further through connectivity with other States and with federal agencies. Most processes execute at the point of service. Results are almost immediate."
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Financial Management/Financial Management BCM.pdf",
    "source_page_range": "15-21",
    "extracted_date": "2026-01-12"
  }
}