{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Financial Management",
  "sub_category": "Financial Management",
  "process_name": "Manage Estate Recovery",
  "process_code": "FM",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Manage Estate Recovery Capability Question Is the process primarily manual or automatic? recovery? How integrated is the process?",
        "levels": {
          "level_1": "paper-based activity to accomplish tasks. SMA communicates with stakeholders and members’ personal representatives via telephone, in person, facsimile, e-mail and mail. SMA has little coordination with other entities that are information sources.",
          "level_2": "automatic processes to accomplish tasks. Communication to stakeholders and members personal representatives is a mix of telephone, facsimile, and mail, plus the use of e-mail and electronic interchange for exchange of larger or standardized sets of information. Agencies are standardizing information to increase coordination Manage Estate Recovery",
          "level_3": "extent possible within the intrastate. SMA communicates with stakeholders via primarily electronic media; paper communications are the exception. SMA adopts MITA Framework, industry standards, and other nationally recognized",
          "level_4": "extent possible across the interstate. SMA adopts MITA Framework, industry standards, and national standards for communications across the interstate. SMA fully integrates the process to the extent possible across the interstate.",
          "level_5": "extent possible across the nation. SMA adopts MITA Framework, industry standards, and national standards for communication across the nation. SMA fully integrates the process to the extent possible across the nation."
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Does the State Medicaid Agency use standards in the process?",
        "levels": {
          "level_1": "thresholds for state and federal regulations using state-specific standards.",
          "level_2": "specific standards. Manage Estate Recovery",
          "level_3": "standards, and other nationally recognized standards for intrastate exchange of information.",
          "level_4": "standards, and other nationally recognized standards for clinical and interstate information exchange.",
          "level_5": "standards, and other nationally recognized standards for national exchange of information."
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question How does the State Medicaid Agency collaborate with other agencies or entities in performing the process?",
        "levels": {
          "level_1": "",
          "level_2": "transactions.",
          "level_3": "reusable business services.",
          "level_4": "reusable processes including clinical information.",
          "level_5": "maximize automation of routine operations."
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "How timely is the end-to-end process? Note: Due to the",
        "levels": {
          "level_1": "mandated requirements for timeliness (i.e., the process achieves results within the time specified by law or regulation).",
          "level_2": "of automation. Timeliness exceeds legal requirements. Manage Estate Recovery",
          "level_3": "collaboration, use of information sharing, standards, and regional information exchange hubs. Timeliness exceeds Level 2.",
          "level_4": "time. Processes that use clinical information result in immediate action, response, and results. SMA has interstate interoperability, which further improves timeliness over Level 3.",
          "level_5": "Processes improve further through connectivity with other States and with federal agencies. Most processes execute at the point of service. Results are almost immediate."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question timeline. How accurate is the information in the process?",
        "levels": {
          "level_1": "collection is manually intensive and susceptible to inconsistent or incorrect information. Stakeholders are unable to rely on information for decision-making. Necessary records at the county and local level are difficult to find and are often not available. SMA stores",
          "level_2": "accuracy of information but the decision-making process may be erroneous or misleading. Accuracy is higher than at Level 1. SMA stores Manage Estate Recovery",
          "level_3": "increases the reliability of SMA’s internal information. External sources of information use MITA Framework and industry standards for information exchange. Decision- making is automatic using standardized business rules definitions. Accuracy is 90% or higher. SMA obtains",
          "level_4": "increases the reliability of SMA’s internal and external sources of information. SMA adopts MITA Framework and industry standards for information exchange with interstate agencies. Decision- making is automatic using regional standardized business rules definitions. Accuracy is 90% or higher. SMA obtains",
          "level_5": "industry standards for information exchange with national agencies. Decision- making is automatic using national standardized business rules definitions. Accuracy is 90% or higher. SMA obtains"
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question the information in the process?",
        "levels": {
          "level_1": "information in disparate systems including paper storage and obtains information manually.",
          "level_2": "information in disparate systems, but automation and HIPAA standards increase accessibility over Level 1.",
          "level_3": "information easily and exchanges with intrastate agencies and entities based on MITA Framework and industry standards. Accessibility is greater than Level 2.",
          "level_4": "information easily and exchanges with interstate agencies and entities. Accessibility is greater than Level 3.",
          "level_5": "information easily and exchanges with national agencies and entities. Accessibility is greater than Level 4."
        }
      },
      {
        "category": "Business Capability Quality: Cost Effectiveness",
        "question": "What is the cost of the process compared to the benefits of its results?",
        "levels": {
          "level_1": "High cost of process needed to support and meet recoupment goals.",
          "level_2": "cost effectiveness ratio over Level 1. Manage Estate Recovery",
          "level_3": "standards further improving cost effectiveness ratio over Level 2.",
          "level_4": "standards for interstate information exchange. SMA increases cost effectiveness ratio over Level 3.",
          "level_5": "standards for national (and international) information exchange. SMA increases cost effectiveness ratio over level 4."
        }
      },
      {
        "category": "Business Capability Quality: Effort to Perform; Efficiency",
        "question": "Capability Question How efficient is the process?",
        "levels": {
          "level_1": "Process is labor intensive. There is wasted effort or expense to accomplish tasks. Process meets minimum state process guidelines and SMA performance standards. Efficiency is low.",
          "level_2": "Automation and state standards increase productivity. Efficiency is higher than Level 1.",
          "level_3": "SMA adopts MITA Framework, industry standards and information exchange with intrastate agencies and entities improving efficiency to 95% or higher.",
          "level_4": "SMA adopts MITA Framework, industry standards and information exchange with interstate agencies and entities improving efficiency to 98% or higher.",
          "level_5": "SMA adopts MITA Framework, industry standards and information exchange with national agencies and entities improving efficiency to 98% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "How accurate are the results of the process?",
        "levels": {
          "level_1": "opportunity for human error. Accuracy is low.",
          "level_2": "business rules definitions reduce error and improve accuracy above Level 1. Manage Estate Recovery",
          "level_3": "standards and information exchange with intrastate agencies and entities improving accuracy to 99% or higher.",
          "level_4": "standards and information exchange with interstate agencies and entities improving accuracy to 99% or higher.",
          "level_5": "standards and information exchange with national agencies and entities improving accuracy to 99% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Utility or Value to Stakeholders",
        "question": "Capability Question Does the business process satisfy stakeholders?",
        "levels": {
          "level_1": "information negatively affecting stakeholder satisfaction with the process.",
          "level_2": "provides clear and useful information. Stakeholder satisfaction is greater than Level 1.",
          "level_3": "standards and information exchange with intrastate agencies and entities improving stakeholder satisfaction to 90% or higher. SMA uses survey or questionnaire for information collection.",
          "level_4": "standards and information exchange with interstate agencies and entities improving stakeholder satisfaction to 95% or higher.",
          "level_5": "standards and information exchange with national agencies and entities improving stakeholder satisfaction to 98% or higher."
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Financial Management/Financial Management BCM.pdf",
    "source_page_range": "15-21",
    "extracted_date": "2026-01-12"
  }
}