{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Operations Management",
  "sub_category": "Operations Management",
  "process_name": "Calculate Spend-Down Amount",
  "process_code": "OM",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Calculate Spend-Down Amount Note: Calculate Spend-Down Amount business operations are no longer relevant at Levels 4 and 5 maturities. Is the process primarily manual or automatic? managing spend down calculations? paid health care bills? track payments for health care bills? down target? provider community? use standards in the process? process?",
        "levels": {
          "level_1": "paper-based activity to accomplish tasks. The member submits the claims and receipts to SMA. There is a manual process for tallying claim amounts, subtracting disallowed amounts, and determining if member has met the spend down in a given period. The member submits the claims/bill and/or receipts to SMA. SMA tracks a member’s costs for health services by tallying paper bills by staff and receipts until member meets spend-down amount for each period. Staff applies spend down business rules to decide whether the submitted costs are allowable and in the appropriate period to apply the costs, sometimes resulting in inconsistent determinations or controversy with the member. The process is manual. If member meets the spend-down, staff keys change in eligibility status into the member’s record so that provider claims will pay for a specified period. Providers submit denied claims for billing to the member until member meets spend down. SMA focuses on meeting compliance thresholds for state and federal regulations using state-specific standards. Very little collaboration occurs with other agencies to standardize information exchange or business tasks.",
          "level_2": "processes to accomplish Calculate Spend-Down Amount tasks. An electronic tally adds member bills and reports on progress toward spend-down threshold. Members may submit electronic spend-down reports, and either scan, facsimile, or mail health care bills and receipts. SMA keys data into an electronic system. Providers submit claims and system automatically applies to spend down. Calculate Spend-Down Amount An electronic tally adds member’s bills and reports on progress toward spend-down threshold. Staff enters information and the system calculates. SMA tests claims submitted by the member against Medicaid Program payment business rules. SMA identifies services and amounts that Medicaid will not pay. Calculate Spend-Down Amount If member meets spend down, staff keys change in eligibility status into the member’s record so that subsequent claims will pay for a specified period. Providers have difficulty determining whether the member has met spend-down requirements and the remaining amount the member has to pay before the provider may bill Medicaid. SMA applies a mix of HIPAA and state-specific standards. SMA collaborates with other agencies and Calculate Spend-Down Amount entities to adopt HIPAA standards and Electronic Data Interchange (EDI) transactions.",
          "level_3": "extent possible within the intrastate. Members are eligible for Medicaid coverage with a deductible amount equal to their spend- down requirements for the specified period. Spend down is essentially eliminated as a distinct process. SMA uses SMA adopts MITA Framework, industry standards, and other nationally recognized standards for access to Health Information Exchange (HIE) for direct billing to payer. SMA tracks deductible until member meets spend-down threshold. System notifies staff and/or claims payment system when member meets spend-down the threshold. The deductible calculation is automatic. SMA receives signal when member will soon reach or has reached the spend-down threshold. Providers are able to determine spend down amount when they verify eligibility. SMA automatically adjusts the member’s spend-down amount during claims processing. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for intrastate exchange of information. SMA collaborates with other intrastate agencies and entities to adopt national standards, and to develop and share reusable business services.",
          "level_4": "Maturity level is not applicable. Maturity level is not applicable. Maturity level is not applicable. Maturity level is not applicable. Maturity level is not applicable. Maturity level is not applicable. Maturity level is not applicable.",
          "level_5": "Maturity level is not applicable. Maturity level is not applicable. Maturity level is not applicable. Maturity level is not applicable. Maturity level is not applicable. Maturity level is not applicable. Maturity level is not applicable."
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "How timely is the end-to-end process?",
        "levels": {
          "level_1": "mandated requirements for timeliness (i.e., the process achieves results within the time specified by law or regulation).",
          "level_2": "automation. Timeliness exceeds legal requirements.",
          "level_3": "collaboration, use of information sharing, standards, and regional information exchange hubs. Switch to auto- deductible accounting supports real-time reporting of spend down totals. Timeliness exceeds Level 2.",
          "level_4": "",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "How accurate is the information in the process? the process?",
        "levels": {
          "level_1": "entry for information collection is manually intensive and susceptible to inconsistent or incorrect information. Stakeholders are unable to rely on information for decision-making. SMA stores information in disparate systems including paper storage and obtains information manually.",
          "level_2": "transactions improve accuracy of information but the decision-making process may be erroneous or misleading. Accuracy is higher than at Level 1. SMA stores information in disparate systems, but automation and HIPAA standards increase accessibility over Level 1. Calculate Spend-Down Amount",
          "level_3": "information collection increases the reliability of SMA’s internal information. External sources of information use MITA Framework and industry standards for information exchange. Decision- making is automatic using standardized business rules definitions. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with intrastate agencies and entities based on MITA Framework and industry standards. Accessibility is greater than Level 2.",
          "level_4": "applicable. Maturity level is not applicable.",
          "level_5": "applicable. Maturity level is not applicable."
        }
      },
      {
        "category": "Business Capability Quality: Cost Effectiveness",
        "question": "What is the cost of the process compared to the benefits of its results?",
        "levels": {
          "level_1": "",
          "level_2": "cost effectiveness ratio over Level 1.",
          "level_3": "standards. Auto- deductible accounting further improving cost effectiveness ratio over Level 2.",
          "level_4": "",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Effort to Perform; Efficiency",
        "question": "How efficient is the process?",
        "levels": {
          "level_1": "Process is labor intensive. There is wasted effort or expense to accomplish tasks. Process meets minimum state process guidelines and SMA performance standards. Efficiency is low.",
          "level_2": "Automation and state standards increase productivity. Efficiency is higher than Level 1. Calculate Spend-Down Amount",
          "level_3": "SMA adopts MITA Framework, industry standards and information exchange with intrastate agencies and entities improving efficiency to 95% or higher.",
          "level_4": "Maturity level is not applicable.",
          "level_5": "Maturity level is not applicable."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "How accurate are the results of the process?",
        "levels": {
          "level_1": "opportunity for human error. Accuracy is low.",
          "level_2": "rules definitions reduce error and improve accuracy above Level 1.",
          "level_3": "standards and information exchange with intrastate agencies and entities improving accuracy to 90% or higher.",
          "level_4": "",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Utility or Value to Stakeholders",
        "question": "Does the business process satisfy stakeholders?",
        "levels": {
          "level_1": "information negatively affecting stakeholder satisfaction with the process.",
          "level_2": "clear and useful information. Stakeholder satisfaction is greater than Level 1. Calculate Spend-Down Amount",
          "level_3": "standards and information exchange with intrastate agencies and entities improving stakeholder satisfaction to 90% or higher. SMA uses survey or questionnaire for information collection.",
          "level_4": "",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Submit Electronic Attachment Is the process primarily manual or automatic?",
        "levels": {
          "level_1": "paper-based activity",
          "level_2": "processes to",
          "level_3": "extent possible within",
          "level_4": "extent possible",
          "level_5": "extent possible"
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Operations Management/Operations Management BCM.pdf",
    "source_page_range": "38-46",
    "extracted_date": "2026-01-12"
  }
}