{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Plan Management",
  "sub_category": "Plan Management",
  "process_name": "Develop Agency Goals and Objectives",
  "process_code": "PL",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Plan Administration Develop Agency Goals and Objectives Capability Question Is the process primarily manual or automatic? change?",
        "levels": {
          "level_1": "manual paper-based activity to accomplish tasks. SMA is unable to adapt easily to changes to the goals and objectives. SMA is unable to provide",
          "level_2": "automatic processes to accomplish tasks. SMA uses tools to gather, record, analyze, formulate, communicate, and distribute information on goals and objectives to SMA leadership and other state agencies. SMA is able to develop and maintain goals and objectives with collaboration from Develop Agency Goals and Objectives",
          "level_3": "extent possible within the intrastate. SMA uses brainstorming and automatic collaboration tools that enable statewide input to the goal setting process. SMA develops and maintains goals and objectives with collaboration from other intrastate",
          "level_4": "extent possible across the interstate. SMA develops and maintains goals and objectives with collaboration from other interstate",
          "level_5": "extent possible across the nation. SMA develops and maintains goals and objectives with collaboration from other intrastate"
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Are goals and objectives traceable throughout the organization? use standards in the process?",
        "levels": {
          "level_1": "objectives. SMA focuses on meeting compliance thresholds for state and federal regulations using state-specific standards.",
          "level_2": "objectives. SMA applies a mix of nationally recognized and state-specific standards. Develop Agency Goals and Objectives",
          "level_3": "the intrastate. SMA uses business intelligence tools to monitor progress toward benchmarks. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for intrastate exchange of information.",
          "level_4": "across the interstate. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for clinical and interstate information exchange.",
          "level_5": "across the nation. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for national exchange of information."
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question How does the State Medicaid Agency collaborate with other agencies or entities in performing the process?",
        "levels": {
          "level_1": "business tasks.",
          "level_2": "transactions.",
          "level_3": "share reusable business services.",
          "level_4": "share reusable processes including clinical information.",
          "level_5": "maximize automation of routine operations."
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "How timely is the end-to-end process?",
        "levels": {
          "level_1": "mandated requirements for timeliness (i.e., the process achieves results within the time specified by law or regulation). SMA develops goals and objectives in an ad hoc manner. Time to complete process is",
          "level_2": "use of automation. SMA conducts more frequent review and modification to goals and objectives. The process completes in less than one (1) month. Develop Agency Goals and Objectives",
          "level_3": "collaboration, use of information sharing, standards, and regional information exchange hubs. SMA develops, modifies, tracks, and report on goals and objectives in generally less than one (1) week.",
          "level_4": "time. Processes that use clinical information result in immediate action, response, and results. SMA has interstate interoperability, which further improves timeliness over Level 3.",
          "level_5": "time. Processes improve further through connectivity with other States and with federal agencies. Most processes execute at the point of service. Results are almost immediate."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accurate is the information in the process? the process?",
        "levels": {
          "level_1": "collection is manually intensive and susceptible to inconsistent or incorrect information. Stakeholders are unable to rely on information for decision-making. SMA stores information in disparate systems including paper storage and obtains information manually. Goals and",
          "level_2": "improve accuracy of information but the decision-making process may be erroneous or misleading. Accuracy is higher than at Level 1. Goals and objectives are up-to-date and more accurate. SMA stores information in disparate systems, but automation and standards increase Develop Agency Goals and Objectives",
          "level_3": "collection increases the reliability of SMA’s internal information. External sources of information use MITA Framework and industry standards for information exchange. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with intrastate agencies and entities based on MITA Framework and industry",
          "level_4": "collection increases the reliability of SMA’s internal and external sources of information. SMA adopts MITA Framework and industry standards for information exchange with interstate agencies. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with interstate agencies and entities. Accessibility is",
          "level_5": "industry standards for information exchange with national agencies. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with national agencies and entities. Accessibility is"
        }
      },
      {
        "category": "Business Capability Quality: Cost Effectiveness",
        "question": "Capability Question What is the cost of the process compared to the benefits of its results?",
        "levels": {
          "level_1": "",
          "level_2": "cost effectiveness ratio over Level 1. Develop Agency Goals and Objectives",
          "level_3": "standards further improving cost effectiveness ratio over Level 2.",
          "level_4": "recognized standards for clinical and interstate information exchange. SMA increases cost effectiveness ratio over Level 3.",
          "level_5": "recognized standards for national (and international) information exchange. SMA increases cost effectiveness ratio over level 4."
        }
      },
      {
        "category": "Business Capability Quality: Effort to Perform; Efficiency",
        "question": "Capability Question How efficient is the process?",
        "levels": {
          "level_1": "Process is labor intensive. There is wasted effort or expense to accomplish tasks. Process meets minimum state process guidelines and SMA performance standards. Efficiency is low.",
          "level_2": "Automation and state standards increase productivity. Efficiency is higher than Level 1.",
          "level_3": "SMA adopts MITA Framework, industry standards and information exchange with intrastate agencies and entities improving efficiency to 95% or higher.",
          "level_4": "SMA adopts MITA Framework, industry standards and information exchange with interstate agencies and entities improving efficiency to 98% or higher.",
          "level_5": "SMA adopts MITA Framework, industry standards and information exchange with national agencies and entities improving efficiency to 98% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "How accurate are the results of the process?",
        "levels": {
          "level_1": "opportunity for human error. Accuracy is low.",
          "level_2": "accuracy above Level 1. Develop Agency Goals and Objectives",
          "level_3": "standards and information exchange with intrastate agencies and entities improving accuracy to 90% or higher.",
          "level_4": "standards and information exchange with interstate agencies and entities improving accuracy to 98% or higher.",
          "level_5": "standards and information exchange with national agencies and entities improving accuracy to 98% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Utility or Value to Stakeholders",
        "question": "Capability Question Does the business process satisfy stakeholders?",
        "levels": {
          "level_1": "information negatively affecting stakeholder satisfaction with the process.",
          "level_2": "provides clear and useful information. Stakeholder satisfaction is greater than Level 1.",
          "level_3": "standards and information exchange with intrastate agencies and entities improving stakeholder satisfaction to 90% or higher. SMA uses survey or questionnaire for information collection.",
          "level_4": "standards and information exchange with interstate agencies and entities improving stakeholder satisfaction to 95% or higher.",
          "level_5": "standards and information exchange with national agencies and entities improving stakeholder satisfaction to 98% or higher."
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Maintain Program Policy Capability Question Is the process primarily manual or automatic? change?",
        "levels": {
          "level_1": "manual paper-based activity to accomplish tasks. SMA is unable to adapt easily to changes to the program policy and provide timely information to stakeholders.",
          "level_2": "automatic processes to accomplish tasks. SMA uses tools to gather, record, analyze, formulate, communicate, and distribute information on program policy to SMA leadership and other state agencies. SMA is able to develop and maintained policy with collaboration from other agencies that encourages flexibility.",
          "level_3": "brainstorming and using automatic collaboration tools, which enables statewide input to the policy setting process. SMA develops and maintains policy with collaboration from other intrastate agencies. SMA quickly distributes modifications to policy to",
          "level_4": "policy setting process by automating processes. SMA develops and maintains policy with collaboration from other interstate agencies. SMA distributes in near- real time modifications to",
          "level_5": "automate processes which enables national input into the policy setting process. SMA develops and maintains policy with collaboration from other intrastate agencies. SMA distributes in near- real time modifications to"
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Plan Management/Plan Management BCM.pdf",
    "source_page_range": "1-8",
    "extracted_date": "2026-01-12"
  }
}