{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Plan Management",
  "sub_category": "Plan Management",
  "process_name": "Maintain Reference Information",
  "process_code": "PL",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Maintain Reference Information Capability Question Is the process primarily manual or automatic?",
        "levels": {
          "level_1": "paper-based activity to accomplish tasks.",
          "level_2": "automatic processes to accomplish tasks. SMA uses business intelligence tools to analyze data to support maintenance Maintain Reference Information",
          "level_3": "extent possible within the intrastate.",
          "level_4": "extent possible extent possible across across the interstate. the nation.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Does the State Medicaid Agency use standards in the process? process?",
        "levels": {
          "level_1": "thresholds for state and federal regulations using state-specific standards. Very little collaboration occurs with other agencies to standardize information exchange or business tasks.",
          "level_2": "specific standards. SMA collaborates with other agencies and entities to adopt HIPAA standards and Electronic Data Interchange (EDI) transactions. Maintain Reference Information",
          "level_3": "standards, and other nationally recognized standards for intrastate exchange of information. SMA collaborates with other intrastate agencies and entities to adopt national standards, and to develop and share reusable business services.",
          "level_4": "standards, and other standards, and other nationally recognized nationally recognized standards for clinical standards for national and interstate exchange of information information. exchange. SMA collaborates SMA collaborates with with other interstate agencies and entities agencies and entities for national (and to adopt national international) standards, and to interoperability develop and share improvements that reusable processes maximize automation including clinical of routine operations. information.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "Capability Question How timely is this end-to-end process?",
        "levels": {
          "level_1": "requirements for timeliness (i.e., the process achieves results within the time specified by law or regulation).",
          "level_2": "use of automation. Timeliness exceeds legal requirements.",
          "level_3": "collaboration, use of information sharing, standards, and regional information exchange hubs. Timeliness exceeds Level 2.",
          "level_4": "time. Processes that improve further use clinical through connectivity information result in with other States and immediate action, with federal agencies. response, and Most processes results. SMA has execute at the point of interstate service. Results are interoperability, almost immediate. which further improves timeliness over Level 3.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "How accurate is the information in the process?",
        "levels": {
          "level_1": "collection is manually intensive and susceptible to inconsistent or incorrect information. Stakeholders are",
          "level_2": "accuracy of information but the decision-making process may be erroneous or misleading. Accuracy Maintain Reference Information",
          "level_3": "increases the reliability of SMA’s internal information. External sources of information use MITA Framework",
          "level_4": "increases the industry standards for reliability of SMA’s information exchange internal and external with national agencies. sources of Decision-making is information. SMA automatic using adopts MITA national standardized",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accessible is the information in the process?",
        "levels": {
          "level_1": "disparate systems including paper storage and obtains information manually.",
          "level_2": "disparate systems, but automation and HIPAA standards increase accessibility over Level 1. Maintain Reference Information",
          "level_3": "and exchanges with intrastate agencies and entities based on MITA Framework and industry standards. Accessibility is greater than Level 2.",
          "level_4": "and exchanges with exchanges with interstate agencies national agencies and and entities. entities. Accessibility is Accessibility is greater greater than Level 3. than Level 4.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Cost Effectiveness",
        "question": "Capability Question What is the cost of the process compared to the benefits of its results?",
        "levels": {
          "level_1": "",
          "level_2": "cost effectiveness ratio over Level 1.",
          "level_3": "standards further improving cost effectiveness ratio over Level 2.",
          "level_4": "standards for standards for national interstate information (and international) exchange. SMA information exchange. increases cost SMA increases cost effectiveness ratio effectiveness ratio over over Level 3. level 4.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Effort to Perform; Efficiency",
        "question": "How efficient is the process?",
        "levels": {
          "level_1": "Process is labor intensive. There is wasted effort or expense to accomplish tasks. Process meets minimum state process guidelines and SMA performance standards. Efficiency",
          "level_2": "Automation and state standards increase productivity. Efficiency is higher than Level 1. Maintain Reference Information",
          "level_3": "SMA adopts MITA Framework, industry standards and information exchange with intrastate agencies and entities improving efficiency to 95% or higher.",
          "level_4": "SMA adopts MITA SMA adopts MITA Framework, industry Framework, industry standards and standards and information information exchange exchange with with national agencies interstate agencies and entities improving and entities efficiency to 98% or improving efficiency higher. to 98% or higher.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accurate are the results of the process?",
        "levels": {
          "level_1": "opportunity for human error. Accuracy is low.",
          "level_2": "business rules definitions reduce error and improve accuracy above Level 1.",
          "level_3": "standards and information exchange with intrastate agencies and entities improving accuracy to 90% or higher.",
          "level_4": "standards and standards and information information exchange exchange with with national agencies interstate agencies and entities improving and entities accuracy to 98% or improving accuracy higher. to 98% or higher.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Utility or Value to Stakeholders",
        "question": "Does the business process satisfy stakeholders?",
        "levels": {
          "level_1": "information negatively affecting stakeholder satisfaction with the process.",
          "level_2": "provides clear and useful information. Stakeholder satisfaction is greater than Level 1. Maintain Reference Information",
          "level_3": "standards and information exchange with intrastate agencies and entities improving stakeholder satisfaction to 90% or higher.",
          "level_4": "standards and standards and information information exchange exchange with with national agencies interstate agencies and entities improving and entities stakeholder improving satisfaction to 98% or stakeholder higher. satisfaction to 95%",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Manage Rate Setting Capability Question Is the process primarily manual or automatic?",
        "levels": {
          "level_1": "paper-based activity to accomplish tasks. SMA focuses on meeting compliance",
          "level_2": "automatic processes to accomplish tasks. SMA applies a mix of HIPAA and state-",
          "level_3": "extent possible within the intrastate. SMA adopts MITA Framework, industry",
          "level_4": "extent possible across the interstate. SMA adopts MITA Framework, industry",
          "level_5": "extent possible across the nation. SMA adopts MITA Framework, industry"
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Plan Management/Plan Management BCM.pdf",
    "source_page_range": "40-46",
    "extracted_date": "2026-01-12"
  }
}