{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Eligibility and Enrollment Management",
  "sub_category": "Eligibility and Enrollment Management",
  "process_name": "Disenroll Member",
  "process_code": "EE",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Disenroll Member NOTE: Applications and Accounts: An individual seeking eligibility for health insurance applies online, via phone, via mail, or in person.. Accepted application data is managed in an “account” by the receiving program to enable access to this information during the verification and eligibility determination processes, as well as after the conclusion of the process to support change reporting and for other purposes. Is the process primarily manual or automated? use standards in the process? process?",
        "levels": {
          "level_1": "activity to accomplish tasks. SMA focuses on meeting compliance thresholds for state and federal regulations using state-specific standards. Very little collaboration occurs with other agencies to standardize information exchange or business tasks.",
          "level_2": "automated processes to accomplish tasks. SMA applies a mix of HIPAA and state- specific standards. Disenroll Member The agency collaborates with other agencies and entities to adopt HIPAA standards and EDI transactions. Disenroll Member",
          "level_3": "of shared enrollment service to maximum extent possible with CHIP and the Marketplace. SMA adopts MITA Framework, industry standards (e.g., HIPAA, Affordable Care Act) and other nationally recognized standards for intrastate exchange of member disenrollment information. SMA collaborates with insurance affordability programs to develop and implement common disenrollment standards. The SMA documents the arrangement in an agreement.",
          "level_4": "of shared enrollment shared enrollment service integrated service and is fully with CHIP and integrated with CHIP Marketplace and Marketplace disenrollment disenrollment process. process. SMA adopts MITA SMA adopts MITA Framework, industry Framework, industry standards (e.g., standards e.g., HIPAA, HIPAA, Affordable Affordable Care Act), Care Act) and other and other nationally nationally recognized recognized standards standards for for national exchange interstate exchange of disenrollment of member information, actively disenrollment participates in the information and ongoing development actively participates of standards, and in the ongoing works with other States development of and federal agencies to related standards. develop and adopt standards related to disenrollment process. SMA participates in SMA participates in a a joint governance joint governance effort effort with the with the Marketplace Marketplace and and CHIP agency to CHIP agency to manage the manage the disenrollment and to disenrollment and to conduct joint planning conduct joint and population planning and management efforts. population The SMA works with management efforts. state and national data The SMA documents sources, the the arrangement in Marketplace, and CHIP an agreement that is agency to establish dynamic and data exchanges and updated as supporting activities conditions change. with programs in other States.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "How timely is the end-to-end process?",
        "levels": {
          "level_1": "mandated requirements for timeliness (e.g., the process achieves results within the time specified by law, or regulation). Disenrollment may take multiple business days.",
          "level_2": "use of automation. Timeliness always meets legal requirements. SMA completes disenrollment in one (1) business day.",
          "level_3": "state and federal collaboration, use of member disenrollment information sharing, and standards. Timeliness exceeds Level 2.",
          "level_4": "time. Processes that improve further through use interstate connectivity with other member regions, States and disenrollment with federal agencies. information result in Most processes immediate action, execute at the point of response, and service. Timeliness results. improves over Level 4.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "How accurate is the information in the process? the process?",
        "levels": {
          "level_1": "collection is manually intensive and susceptible to inconsistent or incorrect information. Stakeholders are unable to rely on information for decision-making. SMA stores information in disparate systems including paper storage and obtains information manually. Systems experience extended scheduled and unscheduled downtime",
          "level_2": "accuracy of information but the decision-making process may be erroneous or Disenroll Member misleading. Accuracy is higher than at Level 1. SMA stores information in disparate systems, but automation and HIPAA standards increase accessibility over Level 1. Systems experience extended scheduled and unscheduled downtime Disenroll Member",
          "level_3": "disenrollment information increasing the reliability of exchange. External sources of member disenrollment information use MITA Framework and industry standards for information exchange. Decision- making is automatic using business rule engines. Accuracy is 90% or higher. SMA easily obtains and uses information from Marketplace and CHIP agency based on MITA Framework and industry standards. Accessibility is greater than Level 2.",
          "level_4": "industry standards Framework, and for disenrollment national standards for information national disenrollment exchange with information exchange. insurance Decision-making is affordability automatic using programs. Decision- business rule engines. making is automatic Accuracy is 98% or using business rule higher. engines. Accuracy is 95% or higher. SMA easily obtains SMA easily obtains and uses and uses information information from from Marketplace and Marketplace and CHIP agency based CHIP agency based on MITA Framework on MITA Framework and industry and industry standards. standards. Accessibility is greater Accessibility is than Level 4. greater than Level 3.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Cost Effectiveness",
        "question": "What is the cost of the process compared to the benefits of its results?",
        "levels": {
          "level_1": "",
          "level_2": "increasing cost effectiveness ratio over Level 1.",
          "level_3": "messages and other nationally recognized standards further increasing cost effectiveness ratio over Level 2.",
          "level_4": "and other nationally nationally recognized recognized standards for national standards for disenrollment disenrollment information exchange. information SMA increases cost exchange increasing effectiveness ratio over cost effectiveness level 4. ratio over Level 3.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Effort to Perform; Efficiency",
        "question": "How efficient is the process?",
        "levels": {
          "level_1": "Process is labor intensive. There is wasted effort or expense to accomplish tasks. Process meets minimum state process guidelines and agency performance standards. Efficiency is low.",
          "level_2": "Automation and state standards increase productivity. Efficiency is higher than Level 1. Disenroll Member",
          "level_3": "SMA adopts automation of disenrollment process improving efficiency to 90% or higher.",
          "level_4": "SMA adopts shared SMA uses shared enrollment services enrollment services improving efficiency improving efficiency to to 95% or higher. 98% or higher.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "How accurate are the results of the process?",
        "levels": {
          "level_1": "opportunity for human error. Accuracy is low.",
          "level_2": "reduce error and improve accuracy above Level 1.",
          "level_3": "for interacting with other state agencies and entities, improving accuracy to 90% or higher.",
          "level_4": "for interacting with interacting with agencies and entities agencies and entities across some states across all states improving accuracy improving accuracy to to 95% or higher. 98% or higher.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Quality: Utility or Value to Stakeholders",
        "question": "How satisfied are the stakeholders?",
        "levels": {
          "level_1": "Stakeholders lack confidence in information negatively affecting stakeholder satisfaction with the process.",
          "level_2": "Automation and standardization provides clear and useful information. Stakeholder satisfaction is greater than Level 1.",
          "level_3": "SMA adopts standard messages for interacting with other state agencies and entities, improving stakeholder satisfaction to 90% or higher.",
          "level_4": "SMA adopts SMA adopts standard standard messages messages for for interacting with interacting with agencies and entities agencies and entities across some states, across all states, improving improving stakeholder stakeholder satisfaction to 98% or satisfaction to 95% higher. or higher.",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Inquire Member Eligibility NOTE: Applications and Accounts: An individual seeking eligibility for health insurance applies online, via phone, via mail, or in person. Accepted application data is managed in an “account” by the receiving program to enable access to this information during the verification and eligibility determination processes, as well as after the conclusion of the process to support change reporting and for other purposes. Is the process primarily manual or automated? use standards in the process?",
        "levels": {
          "level_1": "activity to accomplish tasks. SMA focuses on meeting compliance thresholds for state and federal regulations using state-specific",
          "level_2": "automated processes to accomplish tasks. SMA applies a mix of HIPAA and state- specific standards.",
          "level_3": "eligibility process through use of shared enrollment service to maximum extent possible with CHIP and the Marketplace. SMA adopts MITA Framework, industry standards (e.g., HIPAA, Affordable Care Act) and other nationally recognized standards for",
          "level_4": "eligibility process eligibility process through use of through use of shared shared enrollment enrollment service and service integrated is fully integrated with with CHIP and CHIP and Marketplace. Marketplace. SMA adopts MITA SMA adopts MITA Framework, industry Framework, industry standards (e.g., standards e.g., HIPAA, HIPAA, Affordable Affordable Care Act), Care Act) and other and other nationally nationally recognized recognized standards standards for for national exchange",
          "level_5": ""
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Eligibility and Enrollment Management/Eligibility and Enrollment Management BCM.pdf",
    "source_page_range": "21-27",
    "extracted_date": "2026-01-12"
  }
}