{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Eligibility and Enrollment Management",
  "sub_category": "Eligibility and Enrollment Management",
  "process_name": "Enroll Provider",
  "process_code": "EE",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Enroll Provider Capability Question Does enrollment process meet state and federal regulations or policies?",
        "levels": {
          "level_1": "and accurately.",
          "level_2": "applications timely and accurately. Enroll Provider",
          "level_3": "applications enrollment timely and accurately including one-stop collaboration across SMA.",
          "level_4": "",
          "level_5": ""
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Is the process primarily manual or automatic?",
        "levels": {
          "level_1": "manual paper-based activity to accomplish tasks.",
          "level_2": "automatic processes to accomplish tasks. Enroll Provider",
          "level_3": "extent possible within the intrastate. SMA adopts MITA Framework, enrollment standard messages, and national standards within the intrastate that use standardized business rules definitions for consistent enrollment Provider Network information is shared with Health Insurance Marketplace (HIX). SMA produces audit trail of enrollment decision 100% of the time.",
          "level_4": "to the extent possible within the region. SMA adopts MITA Framework, enrollment standard messages, and national standards within the region that use a regional standardized business rules definitions for consistent enrollment Provider Network information is shared with Health Insurance Marketplace (HIX). SMA shares Meaningful Electronic Health Record information with the Registration",
          "level_5": "to the extent possible across the nation. SMA adopts MITA Framework, enrollment standard messages, and national standards nationally that use a national standardized business rules definitions for consistent enrollment Provider Network information is shared with Health Insurance Marketplace (HIX). SMA shares Meaningful Electronic Health Record information with the R&A"
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question How does the applicant complete and submit the application? use standards in the process?",
        "levels": {
          "level_1": "and submits via facsimile, in person, or mail. SMA focuses on meeting compliance thresholds for state and federal regulations using state-specific standards.",
          "level_2": "paper application but also has choices of data entry at government offices and kiosks. Electronic submissions are available and used. SMA applies a mix of HIPAA and state- specific standards. Enroll Provider",
          "level_3": "nationally standardized electronic application from any location that has internet access. Multiple intrastate programs, including Medicaid, Medicare, and CHIP conduct dual-eligibility determination. SMA adopts MITA Framework, standard enrollment interfaces, and other nationally recognized enrollment standards for intrastate enrollment assignment and",
          "level_4": "interstate. SMA adopts MITA Framework, standard enrollment interfaces, and other nationally recognized enrollment standards for clinical and regional exchange of",
          "level_5": "nation. SMA adopts MITA Framework, standard enrollment interfaces, and other nationally recognized enrollment standards for national exchange of enrollment"
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question How does the State Medicaid Agency collaborate with other agencies or entities in performing the process?",
        "levels": {
          "level_1": "business tasks.",
          "level_2": "transactions.",
          "level_3": "share reusable business services.",
          "level_4": "share reusable enrollment assignment processes including clinical information.",
          "level_5": "improvements that maximize automation of routine enrollment assignment operations."
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "How timely is the end-to-end process?",
        "levels": {
          "level_1": "mandated requirements for timeliness (i.e., the process achieves results within the time specified by law or",
          "level_2": "of automation. Timeliness exceeds legal requirements. Enroll Provider",
          "level_3": "collaboration, use of enrollment assignment information sharing, standards, and regional information",
          "level_4": "information is available in near real time. SMA has regional interoperability, which further improves",
          "level_5": "information is available in real time. Processes improve further through connectivity with other States and with"
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accurate is the information in the process?",
        "levels": {
          "level_1": "collection is manually intensive and susceptible to inconsistent or incorrect information. Stakeholders are unable to rely on information for decision-making.",
          "level_2": "accuracy of information but the decision-making process may be erroneous or misleading. Accuracy is higher than at Level 1. Enroll Provider",
          "level_3": "assignment information increasing the reliability of SMA’s internal information. External sources of enrollment assignment information use MITA Framework and industry standards for information exchange. Decision-",
          "level_4": "assignment information increasing the reliability of regional sources of information. SMA adopts MITA Framework and industry standards or information exchange by regional agencies. Decision-making is automatic using",
          "level_5": "industry standards for national information exchange. Decision- making is automatic using national standardized business rules definitions. Accuracy rating is at 99% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accessible is the information in the process?",
        "levels": {
          "level_1": "disparate systems including paper storage and obtains information manually.",
          "level_2": "disparate systems, but automation and HIPAA standards increase accessibility over Level 1.",
          "level_3": "assignment information easily and exchanges with intrastate agencies and entities based on MITA Framework and industry standards. Enrollment reports on the status of entire Medicaid population in graphical format for management use. Accessibility is greater than Level 2.",
          "level_4": "assignment information easily and exchanges with regional agencies and entities. Accessibility is greater than Level 3.",
          "level_5": "assignment information easily and exchanges with national agencies and entities. Accessibility is greater than Level 4."
        }
      },
      {
        "category": "Business Capability Quality: Cost Effectiveness",
        "question": "What is the cost of Capability Question the process compared to the benefits of its results?",
        "levels": {
          "level_1": "standardized tasks.",
          "level_2": "resolution, improving cost effectiveness ratio over Level 1.",
          "level_3": "assignment standard messages, and other nationally recognized enrollment assignment standards further improving cost effectiveness ratio over Level 2.",
          "level_4": "assignment standard messages, and other nationally recognized enrollment assignment standards for regional information exchange improving cost effectiveness ratio over Level 3.",
          "level_5": "assignment standard messages, and other nationally recognized enrollment assignment standards for national (and international) information exchange. SMA increases cost effectiveness ratio over level 4."
        }
      },
      {
        "category": "Business Capability Quality: Effort to Perform; Efficiency",
        "question": "How efficient is the process?",
        "levels": {
          "level_1": "Process is labor intensive. There is wasted effort or expense to accomplish tasks. Process meets minimum state process guidelines and SMA performance",
          "level_2": "Automation and state standards increase productivity. Efficiency is higher than Level 1. Enroll Provider",
          "level_3": "SMA adopts MITA Framework and enrollment assignment standard messages with intrastate agencies and entities improving efficiency to 95% or higher.",
          "level_4": "SMA adopts MITA Framework and enrollment assignment standard messages with regional agencies and entities improving efficiency to 98% or higher.",
          "level_5": "SMA adopts MITA Framework and enrollment assignment standard messages with national agencies and entities improving efficiency to 98% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accurate are the results of the process?",
        "levels": {
          "level_1": "opportunity for human error. Accuracy is low.",
          "level_2": "business rules definitions reduce error and improve accuracy above Level 1.",
          "level_3": "enrollment assignment standard messages with intrastate agencies and entities improving accuracy to 90% or higher.",
          "level_4": "enrollment assignment standard messages with regional agencies and entities improving accuracy to 98% or higher.",
          "level_5": "enrollment assignment standard messages with national agencies and entities improving accuracy to 98% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Utility or Value to Stakeholders",
        "question": "Does the business process satisfy stakeholders?",
        "levels": {
          "level_1": "information negatively affecting stakeholder satisfaction with the process.",
          "level_2": "provides clear and useful information. Stakeholder satisfaction is greater than Level 1. Enroll Provider",
          "level_3": "enrollment assignment standard messages with intrastate agencies and entities improving stakeholder satisfaction to 90% or",
          "level_4": "enrollment assignment standard messages with regional agencies and entities improving stakeholder satisfaction to 95% or",
          "level_5": "enrollment assignment standard messages with national agencies and entities improving stakeholder satisfaction to 98% or"
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Disenroll Provider Capability Question Is the process primarily manual or automatic?",
        "levels": {
          "level_1": "activity to accomplish tasks.",
          "level_2": "processes to accomplish tasks.",
          "level_3": "disenrollment process within the intrastate. SMA shares Provider Network information with",
          "level_4": "provider disenrollment within the region. SMA shares Provider Network information with",
          "level_5": "disenrollment process across the nation. SMA shares Provider Network information with"
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Eligibility and Enrollment Management/Eligibility and Enrollment Management BCM.pdf",
    "source_page_range": "42-50",
    "extracted_date": "2026-01-12"
  }
}