{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Business Relationship Management",
  "sub_category": "Business Relationship Management",
  "process_name": "Terminate Business Relationship",
  "process_code": "BR",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Terminate Business Relationship Capability Question Is the process primarily manual or automatic? standards in the process?",
        "levels": {
          "level_1": "activity to accomplish tasks. SMA focuses on meeting compliance thresholds for state and federal regulations using state-specific standards.",
          "level_2": "automatic processes to gather, record, communicate, and distribute information to SMA leadership, other state agencies, and participating providers regarding termination of the business relationship. SMA applies a mix of HIPAA and state- specific standards. Terminate Business Relationship",
          "level_3": "extent possible within the intrastate. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for intrastate exchange of information.",
          "level_4": "extent possible across the interstate. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for clinical and interstate information exchange.",
          "level_5": "extent possible across the nation. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for national exchange of information."
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question How does the State Medicaid Agency collaborate with other agencies or entities in performing the process?",
        "levels": {
          "level_1": "",
          "level_2": "transactions.",
          "level_3": "reusable business services.",
          "level_4": "reusable processes including clinical information.",
          "level_5": "maximize automation of routine operations."
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "How timely is this end-to-end process?",
        "levels": {
          "level_1": "mandated requirements for timeliness (i.e., the process achieves results within the time specified by law or regulation). Process completes within 30 business days.",
          "level_2": "of automation. Timeliness exceeds legal requirements. Process completes, on the average, in no more than ten (10) business days.",
          "level_3": "collaboration, use of information sharing, standards, and regional information exchange hubs. Process completes, on the average, in one (1) business day or less.",
          "level_4": "time. SMA has interstate interoperability. Process completes, on the average, in twelve (12) hours or less.",
          "level_5": "Processes improve further through connectivity with other States and with federal agencies. Most processes execute at the point of service. Results are almost immediate."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accurate is the information in the process? the process?",
        "levels": {
          "level_1": "collection is manually intensive and susceptible to inconsistent or incorrect information. Stakeholders are unable to rely on information for decision-making. SMA stores information in disparate systems including paper storage and obtains information manually.",
          "level_2": "accuracy of information but the decision-making process may be erroneous or misleading. Accuracy is higher than at Level 1. SMA stores information in disparate systems, but automation and HIPAA standards increase accessibility Terminate Business Relationship",
          "level_3": "increases the reliability of SMA internal information. External sources of information use MITA Framework for information exchange. Decision- making is automatic using standardized business rules definitions. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with intrastate agencies and entities based on MITA Framework and industry standards.",
          "level_4": "increases the reliability of SMA internal and external sources of information. SMA adopts MITA Framework for information exchange by interstate agencies. Decision- making is automatic using regional standardized business rules definitions. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with interstate agencies and entities. Accessibility is",
          "level_5": "national information exchange. Decision- making is automatic using national standardized business rules definitions. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with national agencies and entities. Accessibility is"
        }
      },
      {
        "category": "Business Capability Quality: Cost Effectiveness",
        "question": "Capability Question What is the cost to perform the process compared to the benefits of the results?",
        "levels": {
          "level_1": "",
          "level_2": "cost effectiveness ratio over Level 1.",
          "level_3": "standards further improving cost effectiveness ratio over Level 2.",
          "level_4": "standards for interstate information exchange. SMA increases cost effectiveness ratio over Level 3.",
          "level_5": "standards for national (and international) information exchange. SMA increases cost effectiveness ratio over level 4."
        }
      },
      {
        "category": "Business Capability Quality: Effort to Perform; Efficiency",
        "question": "How efficient is the process?",
        "levels": {
          "level_1": "Process is labor intensive. There is wasted effort or expense to accomplish tasks. Process meets minimum state process guidelines",
          "level_2": "Automation and state standards increase productivity. Efficiency is higher than Level 1. Terminate Business Relationship",
          "level_3": "SMA adopts MITA Framework, industry standards and information exchange with intrastate agencies and entities improving efficiency",
          "level_4": "SMA adopts MITA Framework, industry standards and information exchange with interstate agencies and entities improving efficiency",
          "level_5": "SMA adopts MITA Framework, industry standards and information exchange with national agencies and entities improving efficiency"
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accurate are the results of the process?",
        "levels": {
          "level_1": "opportunity for human error. Accuracy is low.",
          "level_2": "business rules definitions reduce error and improve accuracy above Level 1.",
          "level_3": "standards and information exchange with intrastate agencies and entities improving accuracy to 90% or higher.",
          "level_4": "standards and information exchange with interstate agencies and entities improving accuracy to 98% or higher.",
          "level_5": "standards and information exchange with national agencies and entities improving accuracy to 98% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Utility or Value to Stakeholders",
        "question": "Does the business process satisfy stakeholders?",
        "levels": {
          "level_1": "information negatively affecting stakeholder satisfaction with the process. Delays and disputes over termination issues",
          "level_2": "provides clear and useful information. Stakeholder satisfaction is greater than Level 1. Terminate Business Relationship",
          "level_3": "standards and information exchange with intrastate agencies and entities improving stakeholder satisfaction to 90% or",
          "level_4": "standards and information exchange with interstate agencies and entities improving stakeholder satisfaction to 95% or",
          "level_5": "standards and information exchange with national agencies and entities improving stakeholder satisfaction to 98% or"
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Business Relationship Management/Business Relationship Management BCM.pdf",
    "source_page_range": "20-25",
    "extracted_date": "2026-01-12"
  }
}