{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Performance Management",
  "sub_category": "Performance Management",
  "process_name": "Identify Utilization Anomalies",
  "process_code": "PE",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Compliance Management Identify Utilization Anomalies Capability Question How integrated is the process? automatic?",
        "levels": {
          "level_1": "There is little coordination between the portions of SMA responsible for identification of utilization anomalies. The process consists primarily of manual paper-based activity to accomplish tasks. SMA enters parameters for identification of cases manually. Exception",
          "level_2": "SMA has central common processes to achieve economies of scale and increase coordination. SMA uses a mix of manual and automatic processes to accomplish tasks for case identification. Identify Utilization Anomalies",
          "level_3": "SMA fully integrates the process within SMA with MITA Framework, and uses industry standards for electronic interchanges between agencies and other entities. SMA automates process to the full extent possible within the intrastate.",
          "level_4": "SMA fully integrates the process to the extent possible across the interstate. SMA automates process to the full extent possible across the interstate.",
          "level_5": "SMA fully integrates the process to the extent possible across the nation. SMA automates process to the full extent possible across the nation."
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Does the State Medicaid Agency use standards in the process? process?",
        "levels": {
          "level_1": "thresholds for state and federal regulations using state-specific standards. Very little collaboration occurs with other agencies to standardize information exchange or business tasks.",
          "level_2": "specific standards. SMA collaborates with other agencies and entities to adopt HIPAA standards and Electronic Data Interchange (EDI) transactions.",
          "level_3": "standards, and other nationally recognized standards for intrastate exchange of information. SMA collaborates with other intrastate agencies and entities to adopt national standards, and to develop and share reusable business services.",
          "level_4": "standards, and other nationally recognized standards for clinical and interstate information exchange. SMA collaborates with other interstate agencies and entities to adopt national standards, and to develop and share reusable processes including clinical information.",
          "level_5": "standards, and other nationally recognized standards for national exchange of information. SMA collaborates with agencies and entities for national (and international) interoperability improvements that maximize automation of routine operations."
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "Capability Question How timely is the end-to-end process?",
        "levels": {
          "level_1": "requirements for timeliness (i.e., the process achieves results within the time specified by law or regulation).",
          "level_2": "use of automation. Timeliness exceeds legal requirements.",
          "level_3": "collaboration, use of information sharing, standards, and regional Health Information Exchange (HIE) and Health Insurance Marketplace (HIX). SMA uses automatic parameters, pattern recognition, and other tools to identify qualifying cases and provide faster turnaround. Standard, large volume processes require 24 hours or less. SMA executes a review in 60 seconds or less per request.",
          "level_4": "time. Processes that use clinical information result in immediate action, response, and results. SMA has interstate interoperability, which further improves timeliness over Level 3.",
          "level_5": "Processes improve further through connectivity with other States and with federal agencies. Most processes execute at the point of service. Results are almost immediate."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accurate is the information in the process? the process?",
        "levels": {
          "level_1": "collection is manually intensive and susceptible to inconsistent or incorrect information. Stakeholders are unable to rely on information for decision-making. SMA stores information in disparate systems including paper storage and obtains",
          "level_2": "accuracy of information but the decision-making process may be erroneous or misleading. Accuracy is higher than at Level 1. SMA stores information in disparate systems, but automation and HIPAA standards increase accessibility Identify Utilization Anomalies",
          "level_3": "increases the reliability of SMA’s internal information. External sources of information use MITA Framework and industry standards for information exchange. Decision- making is automatic using standardized business rules definitions. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with intrastate agencies and entities based on MITA Framework",
          "level_4": "increases the reliability of SMA’s internal and external sources of information. SMA adopts MITA Framework and industry standards for information exchange with interstate agencies. Decision-making is automatic using regional standardized business rules definitions. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with interstate agencies and entities. Accessibility is",
          "level_5": "industry standards for information exchange with national agencies. Decision-making is automatic using national standardized business rules definitions. Accuracy rating is at 99% or higher. SMA obtains information easily and exchanges with national agencies and entities. Accessibility is"
        }
      },
      {
        "category": "Business Capability Quality: Cost Effectiveness",
        "question": "Capability Question What is the cost of the process compared to the benefits of its results?",
        "levels": {
          "level_1": "",
          "level_2": "cost effectiveness ratio over Level 1.",
          "level_3": "standards further improving cost effectiveness ratio over Level 2.",
          "level_4": "standards for interstate information exchange. SMA increases cost effectiveness ratio over Level 3.",
          "level_5": "standards for national (and international) information exchange. SMA increases cost effectiveness ratio over level 4."
        }
      },
      {
        "category": "Business Capability Quality: Effort to Perform; Efficiency",
        "question": "How efficient is the process?",
        "levels": {
          "level_1": "Process is labor intensive. There is wasted effort or expense to accomplish tasks. Process meets",
          "level_2": "Automation and state standards increase productivity. Efficiency is higher Identify Utilization Anomalies",
          "level_3": "SMA adopts MITA Framework, industry standards and information exchange with intrastate",
          "level_4": "SMA adopts MITA Framework, industry standards and information exchange with interstate",
          "level_5": "SMA adopts MITA Framework, industry standards and information exchange with national"
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accurate are the results of the process?",
        "levels": {
          "level_1": "opportunity for human error. Accuracy is low.",
          "level_2": "business rules definitions reduce error and improve accuracy above Level 1.",
          "level_3": "standards and information exchange with intrastate agencies and entities improving accuracy to 90% or higher.",
          "level_4": "standards and information exchange with interstate agencies and entities improving accuracy to 98% or higher.",
          "level_5": "standards and information exchange with national agencies and entities improving accuracy to 98% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Utility or Value to Stakeholders",
        "question": "Does the business process satisfy stakeholders?",
        "levels": {
          "level_1": "information negatively affecting stakeholder satisfaction with the process.",
          "level_2": "provides clear and useful information. Stakeholder satisfaction is greater than Level 1. Identify Utilization Anomalies",
          "level_3": "standards and information exchange with intrastate agencies and entities improving stakeholder",
          "level_4": "standards and information exchange with interstate agencies and entities improving stakeholder",
          "level_5": "standards and information exchange with national agencies and entities improving stakeholder"
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Establish Compliance Incident Capability Question How integrated or central is the process?",
        "levels": {
          "level_1": "parts of the organization. There is little coordination among SMA",
          "level_2": "There is improved coordination between SMA and other stakeholders in",
          "level_3": "and federal law enforcement agencies, CMS, and providers to the",
          "level_4": "suppression of information or corrective action from federal and state law",
          "level_5": "state, regional and federal law enforcement, CMS, providers, and other"
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Performance Management/Performance Management BCM.pdf",
    "source_page_range": "1-7",
    "extracted_date": "2026-01-12"
  }
}