{
  "document_type": "BCM",
  "version": "3.0",
  "version_date": "May 2014",
  "business_area": "Performance Management",
  "sub_category": "Performance Management",
  "process_name": "Manage Compliance Incident Information",
  "process_code": "PE",
  "maturity_model": {
    "capability_questions": [
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Manage Compliance Incident Information Capability Question How integrated or central is the process?",
        "levels": {
          "level_1": "parts of the organization. There is little coordination among SMA",
          "level_2": "SMA improves coordination between SMA and other Manage Compliance Incident Information",
          "level_3": "state and federal law enforcement, CMS, and other intrastate agencies to the",
          "level_4": "state, district and federal law enforcement, CMS, and interstate",
          "level_5": "state, district and federal law enforcement, CMS, and other federal"
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question Is the process primarily manual or automatic? use standards in the process?",
        "levels": {
          "level_1": "paper-based activity to accomplish tasks. SMA manually enters parameters for identification of cases. SMA automates exception processing. SMA focuses on meeting compliance thresholds for state and federal regulations using",
          "level_2": "processes to accomplish tasks. SMA applies a mix of HIPAA and state- specific standards. Manage Compliance Incident Information",
          "level_3": "and federal law enforcement, CMS, and other intrastate agencies to the full extent possible within the intrastate. SMA produces audit trail of compliance decision 100% of the time. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for",
          "level_4": "district and federal law enforcement, CMS, and interstate agencies to the full extent possible across the interstate. SMA adopts MITA Framework, industry standards, and other nationally recognized standards exchange",
          "level_5": "district and federal law enforcement, CMS, and federal agencies to the full extent possible across the nation. SMA adopts MITA Framework, industry standards, and other nationally recognized standards for"
        }
      },
      {
        "category": "Business Capability Descriptions",
        "question": "Capability Question How does the State Medicaid Agency collaborate with other agencies or entities in performing the process?",
        "levels": {
          "level_1": "",
          "level_2": "transactions.",
          "level_3": "reusable business services with state and federal law enforcement, CMS, and other intrastate agencies.",
          "level_4": "reusable processes with state, district and federal law enforcement, CMS, and other interstate agencies including compliance information.",
          "level_5": "maximize automation of routine operations."
        }
      },
      {
        "category": "Business Capability Quality: Timeliness of Process",
        "question": "How timely is the end-to-end Capability Question process?",
        "levels": {
          "level_1": "mandated requirements for timeliness (i.e., the process achieves results within the time specified by law or regulation).",
          "level_2": "of automation. Timeliness exceeds legal requirements.",
          "level_3": "collaboration, use of information sharing, standards, and regional information exchange hubs. Timeliness exceeds Level 2.",
          "level_4": "time. Processes that use compliance information result in immediate action, response, and results. SMA has interstate interoperability, which further improves timeliness over Level 3.",
          "level_5": "Processes improve further through connectivity with other States and federal agencies. Most processes execute at the point of service. Results are almost immediate."
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "How accurate is the information in the process?",
        "levels": {
          "level_1": "collection is manually intensive and susceptible to inconsistent or incorrect information. Stakeholders are unable to rely on information for",
          "level_2": "accuracy of information but the decision-making process may be erroneous or misleading. Accuracy is higher than at Level Manage Compliance Incident Information",
          "level_3": "increases the reliability of SMA’s internal information. External sources of information use MITA Framework and industry standards for information",
          "level_4": "increases the reliability of SMA’s internal and external sources of information. SMA adopts MITA Framework and industry standards for",
          "level_5": "industry standards for information exchange with national agencies. Decision-making is automatic using national standardized business rules"
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accessible is the information in the process?",
        "levels": {
          "level_1": "disparate systems including paper storage and obtains information manually.",
          "level_2": "disparate systems, but automation and HIPAA standards increase accessibility over Level 1.",
          "level_3": "and exchanges with state and federal law enforcement, CMS, and other intrastate agencies and entities based on MITA Framework and industry standards. Access to information ranges from 24 hours to 60 seconds.",
          "level_4": "and exchanges with state, district and federal law enforcement, CMS, and interstate agencies and entities. Accessibility is greater than Level 3.",
          "level_5": "and exchanges with state, district and federal law enforcement, CMS, and other federal agencies and entities. Accessibility is greater than Level 4."
        }
      },
      {
        "category": "Business Capability Quality: Cost Effectiveness",
        "question": "Capability Question What is the cost of the process compared to the benefits of its results?",
        "levels": {
          "level_1": "",
          "level_2": "cost effectiveness ratio over Level 1.",
          "level_3": "enforcement, CMS, and other nationally recognized standards further improving cost effectiveness ratio over Level 2.",
          "level_4": "law enforcement, CMS, and other nationally recognized standards for interstate information exchange. SMA increases cost effectiveness ratio over Level 3.",
          "level_5": "standards for national (and international) information exchange with state and federal law enforcement, CMS, and other federal agencies. SMA increases cost effectiveness ratio over level 4."
        }
      },
      {
        "category": "Business Capability Quality: Effort to Perform; Efficiency",
        "question": "How efficient is the process?",
        "levels": {
          "level_1": "Process is labor intensive. There is wasted effort or expense to accomplish tasks. Process meets minimum state process guidelines",
          "level_2": "Automation and state standards increase productivity. Efficiency is higher than Level 1. Manage Compliance Incident Information",
          "level_3": "SMA adopts MITA Framework, industry standards and information exchange with state and federal law enforcement, CMS, and intrastate agencies and entities",
          "level_4": "SMA adopts MITA Framework, industry standards and information exchange with state, district and federal law enforcement, CMS, and interstate",
          "level_5": "SMA adopts MITA Framework, industry standards and information exchange with state, district and federal law enforcement, CMS, and other federal"
        }
      },
      {
        "category": "Business Capability Quality: Data Access and Accuracy",
        "question": "Capability Question How accurate are the results of the process?",
        "levels": {
          "level_1": "opportunity for human error. Accuracy is low.",
          "level_2": "rules definitions reduce error and improve accuracy above Level 1.",
          "level_3": "standards and information exchange with state and federal law enforcement, CMS, and intrastate agencies and entities improving accuracy to 90% or higher.",
          "level_4": "standards and information exchange with state, district and federal law enforcement, CMS, and interstate agencies and entities improving accuracy to 98% or higher.",
          "level_5": "standards and information exchange with state, district and federal law enforcement, CMS, and federal agencies and entities improving accuracy to 98% or higher."
        }
      },
      {
        "category": "Business Capability Quality: Utility or Value to Stakeholders",
        "question": "Does the business process satisfy stakeholders?",
        "levels": {
          "level_1": "information negatively affecting stakeholder satisfaction with the",
          "level_2": "standardization provides clear and useful information. Stakeholder satisfaction is greater Manage Compliance Incident Information",
          "level_3": "Framework, industry standards and information exchange with state and federal law enforcement,",
          "level_4": "Framework, industry standards and information exchange with state, district and federal law",
          "level_5": "standards and information exchange with state, district and federal law"
        }
      }
    ]
  },
  "metadata": {
    "source_file": "source-pdfs/may-2014-update/bcm/Performance Management/Performance Management BCM.pdf",
    "source_page_range": "14-21",
    "extracted_date": "2026-01-12"
  }
}